In [77]:
# ===== Imports =====
import numpy as np
import pandas as pd

In [78]:
#Task 1 - Create DataFrames & save to CSV
# Project dataframe - note: some rows have missing cost values (use np.nan)
employee = pd.DataFrame(
    { "ID" : ["A001","A002","A003","A004","A005"],
     "Name": ["John Alter","Alice Luxumberg","Tom Sabestine","Nina Adgra","Amy Johny"] ,
    "Gender" : ["M","F","M","F","F"],
    "City":["Paris","London","Berlin","Newyork","Madrid"],
    "Age" : [25,27,29,31,30]}
)
seniority = pd.DataFrame({
    "ID" : ["A001","A002","A003","A004","A005"],
    "Designation Level": [2,2,3,2,3]
})
project = pd.DataFrame({
    "ID" : ["A001","A002","A003","A004","A005","A002","A005","A003","A001","A003","A001","A004","A004","A005"],
    "Project":["Project 1","Project 2","Project 3","Project 4","Project 5","Project 6","Project 7","Project 8","Project 9","Project 10","Project 11","Project 12","Project 13","Project 14"],
    "Cost":[1002000,2000000,4500000,5500000,np.nan,680000,400000,350000,np.nan,300000,2000000,1000000,3000000,200000],
    "Status":["Finished","Ongoing","Finished","Ongoing","Finished","Failed","Finished","Failed","Ongoing","Finished","Failed","Ongoing","Finished","Finished"]
})

In [79]:
# Save dataframe as csv file
employee.to_csv("employee_csv",index = False)
seniority.to_csv("seniority_csv",index = False)
project.to_csv("project_csv",index = False)

In [80]:
# Task 2 - Replace missing project costs using running average (use for loop)
for i in range(len(project)):
    if pd.isna(project.loc[i, 'Cost']):  
        prev_values = project.loc[:i-1, 'Cost'].dropna()
        if len(prev_values) > 0:
            running_avg = prev_values.mean()
            project.loc[i, 'Cost'] = running_avg
        else:
            project.loc[i, 'Cost'] = 0   

print(project)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [81]:
# Task 3 - Split name into First Name & Last Name
employee[["first_name",'last_name']] = employee['Name'].str.split(" ", n=1, expand=True)
employee = employee.drop(columns=["Name"])
employee

     ID Gender     City  Age first_name  last_name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [82]:
# Task 4 - Join all three DataFrames into Final

final = pd.merge(project, employee, how="inner", on='ID')
final = pd.merge(final, seniority, how='inner', on='ID')
new_order = ['ID', 'first_name', 'last_name', 'City', 'Project', 'Cost', 'Status', 'Designation Level', 'Age','Gender']
final = final[new_order]
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Gender
0,A001,John,Alter,Paris,Project 1,1002000.0,Finished,2,25,M
1,A002,Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,F
2,A003,Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,M
3,A004,Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,2,31,F
4,A005,Amy,Johny,Madrid,Project 5,3250500.0,Finished,3,30,F
5,A002,Alice,Luxumberg,London,Project 6,680000.0,Failed,2,27,F
6,A005,Amy,Johny,Madrid,Project 7,400000.0,Finished,3,30,F
7,A003,Tom,Sabestine,Berlin,Project 8,350000.0,Failed,3,29,M
8,A001,John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,M
9,A003,Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,M
10,A001,John,Alter,Paris,Project 11,2000000.0,Failed,2,25,M
11,A004,Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,2,31,F
12,A004,Nina,Adgra,Newyork,Project 13,3000000.0,Finished,2,31,F
13,A005,Amy,Johny,Madrid,Project 14,200000.0,Finished,3,30,F

In [83]:
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Gender
0,A001,John,Alter,Paris,Project 1,1002000.0,Finished,2,25,M
1,A002,Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,F
2,A003,Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,M
3,A004,Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,2,31,F
4,A005,Amy,Johny,Madrid,Project 5,3250500.0,Finished,3,30,F
5,A002,Alice,Luxumberg,London,Project 6,680000.0,Failed,2,27,F
6,A005,Amy,Johny,Madrid,Project 7,400000.0,Finished,3,30,F
7,A003,Tom,Sabestine,Berlin,Project 8,350000.0,Failed,3,29,M
8,A001,John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,M
9,A003,Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,M
10,A001,John,Alter,Paris,Project 11,2000000.0,Failed,2,25,M
11,A004,Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,2,31,F
12,A004,Nina,Adgra,Newyork,Project 13,3000000.0,Finished,2,31,F
13,A005,Amy,Johny,Madrid,Project 14,200000.0,Finished,3,30,F

In [84]:
#Task 5 - Add Bonus column (5% for Finished projects)
final["Bonus"] = np.where(final["Status"]=='Finished',final["Cost"]*0.05,0)

In [85]:
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Gender,Bonus
0,A001,John,Alter,Paris,Project 1,1002000.0,Finished,2,25,M,50100.0
1,A002,Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,F,0.0
2,A003,Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,M,225000.0
3,A004,Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,2,31,F,0.0
4,A005,Amy,Johny,Madrid,Project 5,3250500.0,Finished,3,30,F,162525.0
5,A002,Alice,Luxumberg,London,Project 6,680000.0,Failed,2,27,F,0.0
6,A005,Amy,Johny,Madrid,Project 7,400000.0,Finished,3,30,F,20000.0
7,A003,Tom,Sabestine,Berlin,Project 8,350000.0,Failed,3,29,M,0.0
8,A001,John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,M,0.0
9,A003,Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,M,15000.0
10,A001,John,Alter,Paris,Project 11,2000000.0,Failed,2,25,M,0.0
11,A004,Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,2,31,F,0.0
12,A004,Nina,Adgra,Newyork,Project 13,3000000.0,Finished,2,31,F,150000.0
13,A005,Amy,Johny,Madrid,Project 14,200000.0,Finished,3,30,F,10000.0

In [86]:
# Task 6 - Demote designation for Failed projects and delete records with designation > 4
final.loc[final['Status'] == 'Failed', 'Designation Level'] += 1
final = final[final['Designation Level'] <= 4]
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Gender,Bonus
0,A001,John,Alter,Paris,Project 1,1002000.0,Finished,2,25,M,50100.0
1,A002,Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,F,0.0
2,A003,Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,M,225000.0
3,A004,Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,2,31,F,0.0
4,A005,Amy,Johny,Madrid,Project 5,3250500.0,Finished,3,30,F,162525.0
5,A002,Alice,Luxumberg,London,Project 6,680000.0,Failed,3,27,F,0.0
6,A005,Amy,Johny,Madrid,Project 7,400000.0,Finished,3,30,F,20000.0
7,A003,Tom,Sabestine,Berlin,Project 8,350000.0,Failed,4,29,M,0.0
8,A001,John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,M,0.0
9,A003,Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,M,15000.0
10,A001,John,Alter,Paris,Project 11,2000000.0,Failed,3,25,M,0.0
11,A004,Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,2,31,F,0.0
12,A004,Nina,Adgra,Newyork,Project 13,3000000.0,Finished,2,31,F,150000.0
13,A005,Amy,Johny,Madrid,Project 14,200000.0,Finished,3,30,F,10000.0

In [87]:
#Task 7 - Add Mr./Mrs. to First Name and drop Gender column
final.loc[final['Gender']=='M','first_name']= "Mr. "+ final['first_name']
final.loc[final['Gender']=='F','first_name']= 'Mrs. '+final['first_name']
final=final.drop(columns=['Gender'])
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Bonus
0,A001,Mr. John,Alter,Paris,Project 1,1002000.0,Finished,2,25,50100.0
1,A002,Mrs. Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,0.0
2,A003,Mr. Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,225000.0
3,A004,Mrs. Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,2,31,0.0
4,A005,Mrs. Amy,Johny,Madrid,Project 5,3250500.0,Finished,3,30,162525.0
5,A002,Mrs. Alice,Luxumberg,London,Project 6,680000.0,Failed,3,27,0.0
6,A005,Mrs. Amy,Johny,Madrid,Project 7,400000.0,Finished,3,30,20000.0
7,A003,Mr. Tom,Sabestine,Berlin,Project 8,350000.0,Failed,4,29,0.0
8,A001,Mr. John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,0.0
9,A003,Mr. Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,15000.0
10,A001,Mr. John,Alter,Paris,Project 11,2000000.0,Failed,3,25,0.0
11,A004,Mrs. Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,2,31,0.0
12,A004,Mrs. Nina,Adgra,Newyork,Project 13,3000000.0,Finished,2,31,150000.0
13,A005,Mrs. Amy,Johny,Madrid,Project 14,200000.0,Finished,3,30,10000.0

In [88]:
#Task 8 - Promote by 1 if age > 29 using IF condition
final['Age'] = pd.to_numeric(final['Age'], errors='coerce')
mask_age = final['Age'] > 29
final.loc[mask_age, 'Designation Level'] = final.loc[mask_age, 'Designation Level'] - 1
final.to_csv('Final_after_promotion.csv', index=False)
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Bonus
0,A001,Mr. John,Alter,Paris,Project 1,1002000.0,Finished,2,25,50100.0
1,A002,Mrs. Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,0.0
2,A003,Mr. Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,225000.0
3,A004,Mrs. Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,1,31,0.0
4,A005,Mrs. Amy,Johny,Madrid,Project 5,3250500.0,Finished,2,30,162525.0
5,A002,Mrs. Alice,Luxumberg,London,Project 6,680000.0,Failed,3,27,0.0
6,A005,Mrs. Amy,Johny,Madrid,Project 7,400000.0,Finished,2,30,20000.0
7,A003,Mr. Tom,Sabestine,Berlin,Project 8,350000.0,Failed,4,29,0.0
8,A001,Mr. John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,0.0
9,A003,Mr. Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,15000.0
10,A001,Mr. John,Alter,Paris,Project 11,2000000.0,Failed,3,25,0.0
11,A004,Mrs. Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,1,31,0.0
12,A004,Mrs. Nina,Adgra,Newyork,Project 13,3000000.0,Finished,1,31,150000.0
13,A005,Mrs. Amy,Johny,Madrid,Project 14,200000.0,Finished,2,30,10000.0

In [89]:
final

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Bonus
0,A001,Mr. John,Alter,Paris,Project 1,1002000.0,Finished,2,25,50100.0
1,A002,Mrs. Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,0.0
2,A003,Mr. Tom,Sabestine,Berlin,Project 3,4500000.0,Finished,3,29,225000.0
3,A004,Mrs. Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,1,31,0.0
4,A005,Mrs. Amy,Johny,Madrid,Project 5,3250500.0,Finished,2,30,162525.0
5,A002,Mrs. Alice,Luxumberg,London,Project 6,680000.0,Failed,3,27,0.0
6,A005,Mrs. Amy,Johny,Madrid,Project 7,400000.0,Finished,2,30,20000.0
7,A003,Mr. Tom,Sabestine,Berlin,Project 8,350000.0,Failed,4,29,0.0
8,A001,Mr. John,Alter,Paris,Project 9,2210312.5,Ongoing,2,25,0.0
9,A003,Mr. Tom,Sabestine,Berlin,Project 10,300000.0,Finished,3,29,15000.0
10,A001,Mr. John,Alter,Paris,Project 11,2000000.0,Failed,3,25,0.0
11,A004,Mrs. Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,1,31,0.0
12,A004,Mrs. Nina,Adgra,Newyork,Project 13,3000000.0,Finished,1,31,150000.0
13,A005,Mrs. Amy,Johny,Madrid,Project 14,200000.0,Finished,2,30,10000.0

In [90]:
# Task 9 - Total Project Cost per Employee
totalprojectcost = pd.pivot_table(final,values="Cost",index = ('ID','first_name','last_name'),aggfunc='sum',fill_value=0)
totalprojectcost = totalprojectcost.rename(columns={'Cost': 'Total_Cost'})

In [91]:
totalprojectcost

                           Total_Cost
ID   first_name last_name
A001 Mr. John   Alter       5212312.5
A002 Mrs. Alice Luxumberg   2680000.0
A003 Mr. Tom    Sabestine   5150000.0
A004 Mrs. Nina  Adgra       9500000.0
A005 Mrs. Amy   Johny       3850500.0

In [92]:
# Task 10 - Print employee details whose city contains letter 'o'
o_letter = final['City'].str.contains('o',case=True,na=False)

In [93]:
city_with_o=final[o_letter]

In [94]:
city_with_o

,ID,first_name,last_name,City,Project,Cost,Status,Designation Level,Age,Bonus
1,A002,Mrs. Alice,Luxumberg,London,Project 2,2000000.0,Ongoing,2,27,0.0
3,A004,Mrs. Nina,Adgra,Newyork,Project 4,5500000.0,Ongoing,1,31,0.0
5,A002,Mrs. Alice,Luxumberg,London,Project 6,680000.0,Failed,3,27,0.0
11,A004,Mrs. Nina,Adgra,Newyork,Project 12,1000000.0,Ongoing,1,31,0.0
12,A004,Mrs. Nina,Adgra,Newyork,Project 13,3000000.0,Finished,1,31,150000.0